%提前计算CB11码，并储存在CBlist.mat
clear
G2i=[1 1 1 1 1 1 1  1   2  3 3 3 3 3 3  3   4 4 4 4 4  4   5 5 5 5  5   6 6 6  6   8 8 8   9   9  10;...
     3 4 5 6 8 9 10 11  7  4 5 6 8 9 10 11  5 6 8 9 10 11  6 8 9 10 11  8 9 10 11  9 10 11 10 11  11];

CBs=int8(zeros(37,2046));
% 产生g1,g2 码
g1=int8(ones(1,2057));
g1(1:2:11)=0;
g2=int8(ones(1,2057));
g2(1:2:11)=0;
g=int8(ones(1,2047));
for m=12:2069
    %G1(x)=1+x+x^7+x^8+x^9+x^10+x^11
    A=[1 7 8 9 10 11];
    g1(m)=mod(sum(g1(m-A)),2);
    
    B=[1 2 3 4 5 8 9 11];
    g2(m)=mod(sum(g2(m-B)),2);
end

for m=1:37
    % 产生CB11码
    g=int8(ones(1,1023));
    n=12:2057;
    g(n-11)=xor(g1(n-11),xor(g2(n-G2i(1,m)),g2(n-G2i(2,m))));
    g=g(1:2046)*2-1;
    CBs(m,:)=g;
end
save('CBlist.mat','CBs');
clear all

